SIMISA@@@@@@@@@@JINX0D0t______

 Wagon ( #MT_DD_CLASS_47_47711
 Comment ( Model, textures and supporting files are copyright Making Tracks Rail Simulations Software 2008 )
 Comment ( File lasted edited by DD 12/04/2009 )
 Type ( Engine )
 WagonShape ( MT_DD_CLASS_47_47711.s )
 Size ( 2.8m 3.93m 19.3m )
 Mass ( 115.0t)
 WheelRadius ( 141.37in )
 InertiaTensor ( Box (2.8m 3.9m 19.28m) )
 Coupling (
 Type ( Automatic )
 Spring (
 Stiffness ( 1e6N/m 5e6N/m )
 Damping ( 1e6N/m/s 1e6N/m/s )
 Break ( 3.2e6N 3.2e6N )
 r0 ( 20cm 30cm )
 )
 
 Velocity ( 0.1m/s )
 )
 Buffers (
 Spring (
 Stiffness ( 1e6N/m 5e6N/m )
 Damping ( 1e6N/m/s 1e6N/m/s )
 r0 ( 0m 1e9 )
 )
 Centre ( 0.5 )
 Radius ( 1 )
 Angle ( 0.5deg )
 )
 
 Adheasion ( 0.1 0.5 0.43 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 2.5*250e3lbs )
 DerailBufferForce ( 200kN )
 NumWheels ( 6 )
 Friction (
 100N/m/s 1 -1mph 0 1
 5.1N/rad/s 1 -1rad/s 0 1
 )
 Antislip ( 1 )


 BrakeEquipmentType ( "Triple_valve, Auxilary_reservoir, Emergency_brake_reservoir" )

 BrakeSystemType ( "Air_single_pipe" )
 MaxBrakeForce ( 200kN )

 EmergencyBrakeResMaxPressure( 110 )
 TripleValveRatio( 2.5 )
 MaxReleaseRate( 40 )
 MaxApplicationRate( 40 )
 MaxAuxilaryChargingRate( 35 )
 EmergencyResCapacity( 10 )
 EmergencyResChargingRate( 30 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 70 )

 IntakePoint ( -2.4 0.4 FuelDiesel )
 IntakePoint ( 2.4 0.4 FuelDiesel )

 Lights ( 11
 
 comment ( *** forward lights *** )
 
Light (
 
 Type ( 1 )
 Conditions (
 Control ( 0 )
 Service ( 2 )
 TimeofDay ( 2 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.25 )
 FadeOut ( 0.5 )
 States ( 1
State (
 Duration ( 0.0 )
 LightColour ( aaffffff )
 Position ( -0.195 1.63 0 )
 Transition ( 0 )
 Radius ( 50 )
 Angle ( 7.5 )
 
 )
 )
 )
 
 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 2 )
 Unit ( 2 )
 )
 FadeIn ( 0.2 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( FFD1D17E )
 Position ( -0.235 1.55 9.37 )
 Azimuth ( 0.0 -0.0 0.0 )
 Transition ( 0 )
 Radius ( 0.5 )
 )
 )
 )
 
 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 2 )
 Unit ( 2 )
 )
 FadeIn ( 0.2 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 90ffcc60 )
 Position ( 0.415 2.12 9.32 )
 Azimuth ( 0.0 -0.0 0.0 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )
 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 2 )
 Unit ( 2 )
 )
 FadeIn ( 0.2 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 90ffcc60 )
 Position ( -0.415 2.12 9.32 )
 Azimuth ( 0.0 -0.0 0.0 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )
 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 2 )
 Unit ( 3 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( 0.93 1.93 -9.26 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 2 )
 Unit ( 3 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( -0.93 1.93 -9.26 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )


comment ( ** Stationary Lights ** )


 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 1 )
 Unit ( 3 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( 0.93 1.93 -9.26 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 1 )
 Unit ( 3 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( -0.93 1.93 -9.26 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 1 )
 Unit ( 4 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( -0.93 1.93 9.26 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 0 )
 Service ( 1 )
 Unit ( 4 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( 0.93 1.93 9.26 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )

 )
 Sound ( "..//..//MT_Common.Sound//MT_Class47//#Class47-01.sms" )
 )

 Engine ( #MT_DD_CLASS_47_47711
 Effects
 (
 DieselSpecialEffects
 (
 comment
 (
 the format of these little blocks is as follow:

 offset.x offset.y offset.z
 normal.x normal.y normal.z
 width in metres

 defining the offset from the shape pivot point
 where steam / smoke should appear, the direction
 it should go and the width of the nozzle
 )

 Exhaust1
 (
 0.67 3.90 -2.90
 0 1 0
 0.3
 )
 )
 )
 
 Wagon ( #MT_DD_CLASS_47_47711 )
 Type ( Diesel )
 MaxPower ( 1550kW )
 MaxForce ( 267kN )
 MaxContinuousForce ( 231kN )
 MaxVelocity ( 100mph )
 MaxCurrent ( 4000A )
 WheelRadius ( 141.37in )
 
 Sanding ( 1e9mph )

 NumWheels ( 1.5 )
 MaxTemperature ( 120 )
 MaxOilPressure ( 90 )

 

 
 MaxDieselLevel ( 720gal )
 DieselUsedPerHourAtMaxPower ( 93gal )
 DieselUsedPerHourAtIdle ( 8gal )

 
 
 AirBrakesAirCompressorPowerRating( 1.7 )
 AirBrakesMainMinResAirPressure( 0 )
 AirBrakesMainMaxAirPressure( 130 )
 AirBrakesMainResVolume( 8 )
 AirBrakesAirCompressorWattage( 19000 )
 AirBrakesCompressorRestartPressure( 125 )
 AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.27 )
 AirBrakesHasLowPressureTest( 1 )
 AirBrakesIsCompressorElectricOrMechanical( 1 )

 EngineBrakesControllerMinPressureReduction( 6 )
 TrainBrakesControllerMinPressureReduction( 6 )
 EngineBrakesControllerHasProportionalBrake( 1 )
 EngineBrakesProportionalBrakeLag( 0.9 )
 EngineBrakesControllerMaxApplicationRate( 20 )
 TrainBrakesControllerMaxApplicationRate( 10 )
 EngineBrakesControllerMaxReleaseRate( 20 )
 TrainBrakesControllerMaxReleaseRate( 4 )
 EngineBrakesControllerEmergencyApplicationRate( 50 )
 TrainBrakesControllerEmergencyApplicationRate( 50 )
 EngineBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMinSystemPressure( 0 )
 EngineBrakesControllerMaxSystemPressure( 90 )
 TrainBrakesControllerMaxSystemPressure( 90 )
 EngineBrakesControllerEmergencyBrakeTimePenalty( 0 )
 TrainBrakesControllerEmergencyBrakeTimePenalty( 0 )
 EngineBrakesControllerFullServicePressureDrop( 26 )
 TrainBrakesControllerFullServicePressureDrop( 26 )

 DynamicBrakesMinUsableSpeed( 5 )
 DynamicBrakesMaximumEffectiveSpeed( 25 )
 DynamicBrakesMaximumForce( 100kN )
 DynamicBrakesResistorCurrentLimit ( 700 )
 DynamicBrakesCutInSpeed( 8 )
 DynamicBrakesMaxAirBrakePressure ( 15 )
 DynamicBrakesFadingSpeed( 25 )
 DynamicBrakesDelayTimeBeforeEngaging ( 10 )
 DynamicBrakesMaximumSpeedForFadeOut ( 65 )
 DynamicBrakesEffectAtMaximumFadeOut( 0 )
 DynamicBrakesHigherSpeedCurveExponent( 1 )
 DynamicBrakesLowerSpeedCurveExponent( 1 )
 DynamicBrakesNumberOfControllerNotches( 8 )
 DynamicBrakeHasAutoBailOff( 1 )

 BrakesEngineBrakeType ( "Air_single_pipe" )
 BrakesTrainBrakeType ( "Air_single_pipe" )
 BrakesEngineControllers( "Independent, Train, Dynamic" )




 
 EngineBrakesControllerDirectControlExponent( 1 )

  (* Excessive smoke in ORTS so reduced values to 1/4
 DieselSmokeEffectInitialMagnitude( 1.2 )
 DieselSmokeEffectMaxMagnitude( 4.0 )
 DieselSmokeEffectInitialSmokeRate( 1.8 )
 DieselSmokeEffectMaxSmokeRate( 10.0 ) 
 *)
 DieselSmokeEffectInitialMagnitude( 0.3 )
 DieselSmokeEffectMaxMagnitude( 1.0 )
 DieselSmokeEffectInitialSmokeRate( 0.95)
 DieselSmokeEffectMaxSmokeRate( 2.5 )
 
 DieselEngineIdleRPM( 300 )
 DieselEngineMaxRPM( 750 )
 DieselEngineSpeedOfMaxTractiveEffort( 26mph ) 
 DieselEngineMaxRPMChangeRate( 60 )

 DoesHornTriggerBell( 0 )

 EmergencyStopMonitor(
 MonitoringDeviceMonitorTimeLimit( 0 )
 MonitoringDeviceAlarmTimeLimit( 0 )
 MonitoringDevicePenaltyTimeLimit( 0 )
 MonitoringDeviceCriticalLevel( 0 )
 MonitoringDeviceResetLevel( 0 )
 MonitoringDeviceAppliesFullBrake( 0 )
 MonitoringDeviceAppliesEmergencyBrake( 1 )
 MonitoringDeviceAppliesCutsPower( 0 )
 MonitoringDeviceAppliesShutsDownEngine( 0 )
 )

 AWSMonitor(
 MonitoringDeviceMonitorTimeLimit( -1 )
 MonitoringDeviceAlarmTimeLimit( 5 )
 MonitoringDevicePenaltyTimeLimit( 0 )
 MonitoringDeviceCriticalLevel( 0 )
 MonitoringDeviceResetLevel( 0 )
 MonitoringDeviceAppliesFullBrake( 0 )
 MonitoringDeviceAppliesEmergencyBrake( 1 )
 MonitoringDeviceAppliesCutsPower( 0 )
 MonitoringDeviceAppliesShutsDownEngine( 0 )
 )
 
 EngineVariables( 3600 )
 
 
 
 EngineControllers (
 Throttle ( 0 1 0.125 0 0.
 NumNotches ( 9
 Notch ( 0 0 Dummy )
 Notch ( 0.125 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.375 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.625 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 0.875 0 Dummy )
 Notch ( 1 0 Dummy )
 )
 )
 Brake_Engine ( 0 1 0.0125 0
 NumNotches ( 1
 Notch( 0 1 Dummy )
 )
 )
 Brake_Train ( 0 1 0.0125 0.75
 NumNotches ( 4
 Notch( 0 0 TrainBrakesControllerReleaseStart )
 Notch( 0.15 1 TrainBrakesControllerGraduatedSelfLapLimitedHoldingStart )
 Notch( 0.65 0 TrainBrakesControllerSuppressionStart )
 Notch( 0.8 0 TrainBrakesControllerContinuousServiceStart )



 )
 )
 DirControl ( -1 0 1 1 )
 BellToggle( 0 1 0 )
 AWS ( 0 1 0 )
 Horn ( 0 1 0 )
 Wipers ( 0 1 0 )
 EmergencyStopResetToggle( 0 1 0 )
 EmergencyStopToggle( 0 1 0 )
 Vigilance ( 0 1 0 )
 Headlights ( 0 0.25 1 0 )
 BailOffButton( 0 1 0 )
 )
 
 
 
 Name ("#MT Class 47 47711 BR Large Logo")
 Description (
 "The Brush type 4, class 47 diesel-electric locomotive, a popular and versatile performer capable of tasks ranging "+
 "from main line expresses to pulling engineering duties.\n\n"+
 "Locomotive type: Diesel-Electric\n\n"+
 "Power source: Diesel engine\n\n"+
 "Power: 2,520 hp\n\n"+
 "Max. speed: 100 mph \n\n"+
 "Traction motors: Six Brush axle-hung\n\n"+
 "Max. continuous tractive effort: 60,000 lb \n\n"+
 "Wheel configuration: Twelve 45-in tapered tread in Co-Co configuration (three sets of three "+
 "driven axles)\n\n"+
 "Height: 15 ft. 4 in. (4.7 m)\n\n"+
 "Weight: 115 metric tons\n\n"+
 "Length: 63 ft. 6 in. \n\n"+
 "Width: 8 ft. 9 3/4 in. \n\n"+
 "Model (c) 2008 Daryn Dunkley\n\n"+
 "Textures (c) 2008 Daryn Dunkley"
 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key to move the Reverser to Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
 "4. Press the D key to move the throttle from Idle to Notch 1.\n"+
 "5. Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the throttle to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the dynamic brakes\n"+
 "1. Press the A key to move the throttle to the Idle position.\n"+
 "2. Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position. After allowing a few seconds for braking circuit setup, press the . (PERIOD) key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
 "To release the dynamic brakes\n"+
 "1. Press the D key to move the throttle towards Idle.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
 "To bail off the train brakes on the locomotive\n"+
 "1. Press the / (FORWARD SLASH) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
 "To apply the locomotive brake\n"+
 "1. Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
 "To release the locomotive brake\n"+
 "1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
 "To activate emergency braking\n"+
 "1. Press the A key to reduce the throttle to Idle.\n"+
 "2. Press the BACKSPACE key to activate emergency braking.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+
 "2. Press the S key to move the Reverser to the Reverse position.\n"+
 "3. Release the brakes.\n"+
 "4. Slowly advance the throttle lever (D key).\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window."
 ) 
)